Revit 2027 API
DuctFittingAndAccessoryPressureDropUIDataItem.GetDuctFittingAndAccessoryData Method
 Gets the fitting data stored in the UI data item.
Namespace: Autodesk.Revit.UI.Mechanical
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public DuctFittingAndAccessoryData GetDuctFittingAndAccessoryData()
Public Function GetDuctFittingAndAccessoryData As DuctFittingAndAccessoryData
public:
DuctFittingAndAccessoryData^ GetDuctFittingAndAccessoryData()
member GetDuctFittingAndAccessoryData : unit -> DuctFittingAndAccessoryData
Return Value
DuctFittingAndAccessoryData
 The fitting data stored in the UI data item.
See Also
Reference
DuctFittingAndAccessoryPressureDropUIDataItem Class
Autodesk.Revit.UI.Mechanical Namespace